# Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123]
import random

work_list = [random.randint(1, 50) for _ in range(30)]

res_list = [work_list[i] for i in range(len(work_list)) if work_list[i] > work_list[i-1]]

print(f'{work_list}\n{res_list}')
